apps/nfe/wsdl/nfeinutilizacao.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="NFeInutilizacaoService"
  targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeInutilizacao"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeInutilizacao"
  xmlns:nfe="http://www.portalfiscal.inf.br/nfe"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
>

  <wsdl:types>
    <xsd:schema targetNamespace="http://www.portalfiscal.inf.br/nfe">
      <xsd:import namespace="http://www.portalfiscal.inf.br/nfe"
        schemaLocation="../xsd/inutNFe_v4.00.xsd" />
      <xsd:import namespace="http://www.portalfiscal.inf.br/nfe"
        schemaLocation="../xsd/retInutNFe_v4.00.xsd" />
    </xsd:schema>
  </wsdl:types>

  <wsdl:message name="nfeInutilizacaoNFRequest">
    <wsdl:part name="nfeDadosMsg" element="nfe:inutNFe" />
  </wsdl:message>
  <wsdl:message name="nfeInutilizacaoNFResponse">
    <wsdl:part name="nfeResultMsg" element="nfe:retInutNFe" />
  </wsdl:message>

  <wsdl:portType name="NFeInutilizacaoPortType">
    <wsdl:operation name="nfelnutilizacaoNF">
      <wsdl:input message="tns:nfeInutilizacaoNFRequest" />
      <wsdl:output message="tns:nfeInutilizacaoNFResponse" />
    </wsdl:operation>
  </wsdl:portType>

  <wsdl:binding name="NFeInutilizacaoSoapBinding" type="tns:NFeInutilizacaoPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="nfelnutilizacaoNF">
      <soap:operation
        soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeInutilizacao/nfeInutilizacaoNF" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:service name="NFeInutilizacaoService">
    <wsdl:port name="NFeInutilizacaoPort" binding="tns:NFeInutilizacaoSoapBinding">
      <soap:address location="https://localhost:3000/ws/nfeinutilizacao" />
    </wsdl:port>
  </wsdl:service>

</wsdl:definitions>
